{
  "header": "\n    <h2>Course details</h2><span class=\"icons\"></span>\n  ",
  "year1Modules": "\n\n\n\n            <li>\n              <h3 class=\"course-stage-heading\">Year 1</h3>\n</li>\n            <li id=\"course_stage_102597\">\n                  <h4 class=\"course-stage-heading\">Core modules</h4>\n                  <ul class=\"course-modules\">\n                    <li class=\"course-module\" data-id=\"course_module_11637\">\n  <p>\n    <span class=\"name\">Stage 1 Computing Placement Preparation (BPIE111)</span>\n</p>\n    <p class=\"course-module-description\">This module is aimed at students who may be undertaking an industrial placement in the\nthird year of their programme. It is designed to assist students in their search for a\nplacement and in their preparation for the placement itself. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15589\">\n  <p>\n    <span class=\"name\">Software Engineering 1 (COMP1000)</span>\n</p>\n    <p class=\"course-module-description\">This module exposes students to the principles of software design and construction. The basics of constructing source code to solve a problem will be introduced, exposing students to common control structures alongside concepts such as types and generics. Major programming paradigms such as object orientation and functional programming are introduced. Additionally, key software development tools and methods are explored. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15591\">\n  <p>\n    <span class=\"name\">Computer Systems (COMP1001)</span>\n</p>\n    <p class=\"course-module-description\">This module provides students with an underpinning knowledge of how computers work. Topics include low-level systems and representation of data, operating systems, and an introduction to subjects such as virtualisation, parallelism, state and communications. Students will learn how operating systems manage processes and scheduling, and how memory management works. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15593\">\n  <p>\n    <span class=\"name\">Cyber Security &amp; Networks (COMP1002)</span>\n</p>\n    <p class=\"course-module-description\">Modern computing relies upon networking and robust cyber security. This module provides an appreciation of their core enabling technologies, discussing how they can be applied. Key networking topics include routing and switching, as well as wireless networks. Key areas of security include underlying concepts and threats, and exploring security technologies that can be applied to enable defence in depth. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15595\">\n  <p>\n    <span class=\"name\">Algorithms, Data Structures and Mathematics (COMP1003)</span>\n</p>\n    <p class=\"course-module-description\">Data structures and algorithms lie at the heart of Computer Science as they are the basis for an efficient solution of programming tasks. In this module, students will study core algorithms and data structures, as well as being given an introduction to algorithm analysis and basic Mathematics for Computer Science. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15597\">\n  <p>\n    <span class=\"name\">Computing Practice (COMP1004)</span>\n</p>\n    <p class=\"course-module-description\">This module applies problem-based learning to provide students with the ability to identify problems and derive appropriate and considered solutions. A focus will be given to the early stages of the software development lifecycle to develop the skills of eliciting requirements whilst considering operational and technical trade-offs. The module will culminate in the creation of a simple yet complete software solution. </p>\n</li>\n\n                  </ul>\n            </li>\n\n            <li>\n              <h3 class=\"course-stage-heading\">Year 2</h3>\n</li>\n            <li id=\"course_stage_102599\">\n                  <h4 class=\"course-stage-heading\">Core modules</h4>\n                  <ul class=\"course-modules\">\n                    <li class=\"course-module\" data-id=\"course_module_11638\">\n  <p>\n    <span class=\"name\">Stage 2 Computing Placement Preparation (BPIE211)</span>\n</p>\n    <p class=\"course-module-description\">This module is aimed at students who may be undertaking an industrial placement in the\nthird year of their programme. It is designed build on the Level 1 module (BPIE111) and to\nassist students in their search for a placement and in their preparation for the placement\nitself. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15599\">\n  <p>\n    <span class=\"name\">Software Engineering 2 (COMP2000)</span>\n</p>\n    <p class=\"course-module-description\">Students’ understanding of software engineering is expanded by introducing a range of topics that instil best practice. Students will learn how to implement faster software using parallelism and consider aspects of human-computer interaction. Object-orientation and functional programming are revisited, while event-driven programming is introduced. Common design patterns used in the construction of software are introduced. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15601\">\n  <p>\n    <span class=\"name\">Information Management &amp; Retrieval (COMP2001)</span>\n</p>\n    <p class=\"course-module-description\">This module introduces students to the fundamental concepts for graphical representation, information management, database systems and data modelling.  The capture, digitisation, representation, organisation, transformation and presentation of information is explored using conceptual and physical data models. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15603\">\n  <p>\n    <span class=\"name\">Artificial Intelligence (COMP2002)</span>\n</p>\n    <p class=\"course-module-description\">This module provides students with an introduction to the principles of artificial intelligence and the methods used in that field. Topics covered include search and optimisation, knowledge representation and reasoning, and machine learning. Students will gain experience of modelling and simulation, and will apply analytical tools to evaluating results, and will consider the ethical implications of the introduction of AI. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15605\">\n  <p>\n    <span class=\"name\">Computing Group Project (COMP2003)</span>\n</p>\n    <p class=\"course-module-description\">Knowledge gained in earlier stages of the computing programmes is consolidated and integrated into a substantial project. Students work in teams, champion professional roles, design and develop a software solution for a given scenario. The project integrates and expands upon software development stages covered on the course (project management, analysis, design, construction, communication, security and/or networking). </p>\n</li>\n\n                  </ul>\n                  <h4 class=\"course-stage-heading\">Optional modules</h4>\n                  <ul class=\"course-modules\">\n                    <li class=\"course-module\" data-id=\"course_module_15859\">\n  <p>\n    <span class=\"name\">Software Development Tools and Practices (COMP2005)</span>\n</p>\n    <p class=\"course-module-description\">This module explores the current state of the art in testing tools, including static and dynamic analysis tools. It explores programming environments that automate parts of program construction processes (e.g., automated builds) and continuous integration. Software verification and validation concepts are introduced along with testing types and testing fundamentals. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15865\">\n  <p>\n    <span class=\"name\">Security Architectures &amp; Cryptography (COMP2006)</span>\n</p>\n    <p class=\"course-module-description\">The ability to design secure systems is critical to the successful operation of any system. This module will develop the knowledge and understanding of security architectures, design principles (such as least privilege, default deny) and elicitation of security requirements to enable the design of secure systems. Core to this knowledge is the role cryptography can have in addressing these requirements. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15875\">\n  <p>\n    <span class=\"name\">Game Development (COMP2007)</span>\n</p>\n    <p class=\"course-module-description\">This module provides a series of workshops in interactive systems for game developers with a core lecture series resulting in a substantial individual student project. The workshop series will also introduce students to the game development pipeline through an iterative process, tools and methods used in industry, developing professional practice. </p>\n</li>\n\n                  </ul>\n            </li>\n\n            <li>\n              <h3 class=\"course-stage-heading\">Year 3</h3>\n</li>\n            <li id=\"course_stage_102601\">\n                  <h4 class=\"course-stage-heading\">Core modules</h4>\n                  <ul class=\"course-modules\">\n                    <li class=\"course-module\" data-id=\"course_module_584\">\n  <p>\n    <span class=\"name\">Computing Related Placement (Generic) (BPIE330)</span>\n</p>\n    <p class=\"course-module-description\">A 48-week period of professional training spent as the third year of a sandwich course, undertaking an approved placement with a suitable company. This provides an opportunity for you to gain relevant industrial experience to consolidate the first two years of study and to prepare for the final year and employment after graduation. Please note this placement is optional but strongly recommended. </p>\n</li>\n\n                  </ul>\n            </li>\n\n            <li>\n              <h3 class=\"course-stage-heading\">Final year</h3>\n</li>\n            <li id=\"course_stage_102603\">\n                  <h4 class=\"course-stage-heading\">Core modules</h4>\n                  <ul class=\"course-modules\">\n                    <li class=\"course-module\" data-id=\"course_module_15609\">\n  <p>\n    <span class=\"name\">Computing Project (COMP3000)</span>\n</p>\n    <p class=\"course-module-description\">The Computing Project provides an opportunity to tackle a major computing related problem in an approved topic area relevant to the programme of study. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15615\">\n  <p>\n    <span class=\"name\">Machine Learning (COMP3003)</span>\n</p>\n    <p class=\"course-module-description\">This module introduces machine learning, covering unsupervised, supervised and reinforcement learning from a Bayesian perspective. This includes theory behind a range of learning techniques and how to apply these representations of data in systems that make decisions and predictions. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_19034\">\n  <p>\n    <span class=\"name\">Human-Robot Interaction (COMP3018)</span>\n</p>\n    <p class=\"course-module-description\">This module provides basic knowledge about the growing field of human-robot interaction. It discusses how to create and evaluate a multimodal human-robot interactive system and highlights its applications in daily life. Besides, it discusses how an intelligent robot can learn from experience in the surroundings and what kind of cognitive architectures and models can be used to manage its behaviours in complex environments. </p>\n</li>\n\n                  </ul>\n                  <h4 class=\"course-stage-heading\">Optional modules</h4>\n                  <ul class=\"course-modules\">\n                    <li class=\"course-module\" data-id=\"course_module_15611\">\n  <p>\n    <span class=\"name\">Parallel Computing (COMP3001)</span>\n</p>\n    <p class=\"course-module-description\">This module develops an understanding of problems in Computer Science which take advantage of general-purpose computing on GPUs. It provides practical methodologies to reformulate problems in terms of hardware architecture, graphics primitives and high-performance computing concepts, as supported by the most recent GPUs. It develops the skills to implement parallel solutions with common GP-GPU computing languages. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15613\">\n  <p>\n    <span class=\"name\">Alternative Paradigms (COMP3002)</span>\n</p>\n    <p class=\"course-module-description\">Imperative programming and related “classic” machines like finite state or Turing machines dominate the field of computing. This module aims to expose students to ways of thinking about computational problems that go beyond mainstream imperative styles (e.g., functional and declarative programming) and to ideas and workings of and behind unconventional and upcoming computing paradigms (e.g. quantum or neural computing). </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15621\">\n  <p>\n    <span class=\"name\">Full-Stack Development (COMP3006)</span>\n</p>\n    <p class=\"course-module-description\">This module explores the production of dynamic web applications with a particular focus on the web environment. Key elements such as object oriented and event-based development, asynchronous client-server communication and distributed content representation are explored through practical production. The production of a working system uses dynamic web frameworks such as HTML, CSS and JavaScript/jQuery. </p>\n</li>\n<li class=\"course-module\" data-id=\"course_module_15863\">\n  <p>\n    <span class=\"name\">Big Data Analytics (COMP3008)</span>\n</p>\n    <p class=\"course-module-description\">The key objective of this module is to familiarise the students with the most important information technologies used in manipulating, storing and analysing big data. Students will work with semi-structured datasets and choose appropriate storage structures for them. A representative of recent non-relational trends is presented—namely, graph-oriented databases. </p>\n</li>\n\n                  </ul>\n            </li>\n      "
}
