
{
  "schoolTitle": "School of Engineering, Computing and Mathematics",
  "courseTitle": "Computer Science (Artificial Intelligence)",
  "detailsTable": "UCAS tariff\n        120 - 128\n      \n        \n          UCAS course code\n          I400\n        \n    \n      Institution code\n      P60\n    \n  \n     Duration\n      \n          3 years (+ optional placement)\n  \n  \n    Course type\n    Full-time\n  \n  \n    Location\n    Plymouth",
  "registerButton": "/forms/open-day/registration",
  "applyButton": "http://www.ucas.com/apply",
  "overviewText": "Artificial intelligence (AI) is a rapidly growing field within computer science, and this course will give you the skills you need to excel within it. Topics will range from real-word applications of AI to understanding the theoretical underpinnings of the subject, to creating the innovative AI-driven tools that will drive Industry 4.0. You will also focus on the wider ethical and societal implications of AI. Taught by a team of internationally recognised AI experts with extensive research and commercial experience that is drawn upon in a research-led teaching experience; and providing students with an exciting opportunity to engage with world-leading research.",
  "careerTopic": "Careers with this subject",
  "careerDescript": "Artificial intelligence graduates have gained employment as:\nmobile developers\nweb application developers\nsoftware developers\nproject managers\nsystems analysts\nsoftware engineers\nUX developer\ndata analytics developer\nAI developer\nmachine learning engineer\ndata engineer/architect.",
  "careers": [
    "mobile developers",
    "web application developers",
    "software developers",
    "project managers",
    "systems analysts",
    "software engineers",
    "UX developer",
    "data analytics developer",
    "AI developer",
    "machine learning engineer",
    "data engineer/architect."
  ],
  "keyFeaturesTopic": "Key features",
  "keyFeaturesList": [
    "Be inspired by the creativity that our practical, hands-on course nurturesOur ‘learning through doing’ ethos means you build the skills to make you desirable to employers. You’ll learn from dedicated teaching staff engaged in internationally significant research, actively creating and developing applications.",
    "Collaborate and buildMirroring the teamwork at the heart of the industry, you’ll work in a team to develop work with a real purpose.",
    "Get a head-start in the industryBenefit from a programme with strong links with industry, (e.g. Apple, Microsoft, IBM, Oracle and Intel) and those links are used to embed relevant real-world problems directly into the programmes."
  ]
}
